[

    {
	"teamName": "Kneeling Kaepernicks",
	"description": "Winning despite Scam Newton putting up negative points? That’s some real shit. RBs look stacked and CMC should be coming off IR soon. But will starting Scotty “Doesn’t Know” Miller and Brandon “Aiyuk, Imma Beat My Meat” pay off during BYE week hell against Luke? ",
	"record": "5-2",
	"managerName": "Marquin Evans"
  },



  {
	"teamName": "Tim Duncan",
	"description": "It’s pretty cool that Julian Edelman is following the same career path as Wes Welker, small, white, New England slot receivers that won’t be able to walk without a cane post-retirement due to injuries. Kind of bullshit that Schempp was able to get Patrick Mahomes, Lamar was looking like a shell of his MVP season and Damian Harris is a complete non-factor. Schempp fleecing the worst team in the league, new season same old bullshit. ",
	"record": "5-2",
	"managerName": "Alex Schempp"
  },


    {
	"teamName": "Show Me Your TD’s",
	"description": "God damn Nick’s team tore Luke a new one this week. Lockett and Adams both exploded in the same week. Seems like Nick has at least one guy per week that absolutely puts his nuts all over the defense. Josh Allen has calmed down from his otherworldly start, could be trouble once the snow starts in Buffalo. Also imagine (Dragons) holding a kicker not named Justin Tucker thru the BYE week. Zane is 13th in scoring and doesn’t have a nice schedule coming up. Just a waste of a roster spot. ",
	"record": "4-3",
	"managerName": "Nick Mauro"
  },

    {
	"teamName": "Can U Digg it Sucka",
	"description": "Maybe if Luke would have started a D/ST this week they could have scored the 66.5 points that he lost by to Nick. Zeke? More like “Weak” Noah Fant? More Like “Noah Can’t” Steve’s fuck up dropping Gio Bernard could end up being pretty valuable for Judge Mo Dollars. Will someone please trade with Luke already?",
	"record": "4-3",
	"managerName": "Luke Morrell"
  },


    {
	"teamName": "Discount Double Check",
	"description": "I thought Chase Claypool was supposed to be the Canadian Calvin Johnson, MapleTron? 0.3 points on the week is more like SmegmaTron. Marquis’ team is hurting without Aaron Jones, could be in danger of slipping to .500 if he can’t play this week. Continuing to start a known criminal in Melvin Gordon is pretty scummy. Have you no honor? Why don’t you go ahead and pick up Mike Vick and OJ Simpson while you’re at it?",
	"record": "4-3",
	"managerName": "Marquis Evans"
  },



     {
	"teamName": "Kenyan Drake is a Bum",
	"description": "Oh how the mighty have fallen, 0-3 since without Chubb. Steve is no longer partying like they do in Pittsburgh. So many single digit outputs against Marquin, I don’t even know where to start. Kenyan Drake is a bum, just like everyone already knew. DK Metcalf was absolutely cucked by Tyler Lockett this week. Despite how much I dislike Tom Brady, I must admit that he’s been ballin’ out lately. Must be getting some A-1, premium top from Gisele and make-out sessions with his son. ",
	"record": "4-3",
	"managerName": "Steven Jackson"
  },


    {
	"teamName": "Kittle and Bits",
	"description": "Not much you can do with all those BYEs and injuries last week, and Antonio Brown coming into Tampa could make Mike Evans’ sporadic targets even lower. CeeDee “DVD Sheep” Lamb is going to be slaughtered with Ben DiNucci as QB in Dallas and Mixon still might be out this week. Times are tough in Jeff’s fantasy world. Michael Thomas with just 3 receptions after 7 games due to injury, is that one of the worst 1st round picks of all-time? ",
	"record": "3-4",
	"managerName": "Jeff McNalley"
  },



    {
	"teamName": "Baltimore Bombscares",
	"description": "If Aaron Rodgers didn’t muster up 31 points this week we could have seen another all-time low performance out of Bob’s team. OBJ being done for the year makes me sad, hope he’s getting plenty of bed rest and has an Instagram model on payroll to pinch a fat loaf on his chest once a day while he heals up. Losing to Dylan? Ouch. ",
	"record": "4-3",
	"managerName": "Robert Sanders"
  },


    {
	"teamName": "Whole Lotta Redzone",
	"description": "Andy keeps churning and suddenly finds himself within striking distance of the playoffs. Todd Gurley may have single-handedly lost the game for Atlanta, but he’s helped Andy to a win this week and looks like a true RB1 this year. Gotta point out the projected total difference between Nick and Andy in their matchup this week: 129.6 to 99.1. Could be the upset of the century, or we might see Andy get blasted and Nyheim Hines score 4.5 points as usual.",
	"record": "3-4",
	"managerName": "Andy Chandler"
  },



    {
	"teamName": "Golladay Inn Express",
	"description": "And the L’s start coming and they don’t stop coming. Sam drops a close one against Andy, cemented by Todd Gurley scoring at the end of the Falcons game. Justin “Herbie” Herbert was Fully Loaded against Jacksonville scoring 41 points, but just like me junior-year at Heritage playing basketball - left on the bench. Can Sam right the ship and turn his season around? Who cares he already won $1000 this year.",
	"record": "2-5",
	"managerName": "Sam Spradlin"
  },


  	{
	"teamName": "Football Playin Kings in Space",
	"description": "Don’t look now, but we’re on a win streak. The most-MAGA sounding name in the league, Boston Scott, helped lead the team to victory and Mr. Unliiiiiimited dry-humped his way to 32.9 points. I feel some momentum on my side now. DJ, AJ, JK, IDK it doesn’t matter. We’re fully torqued. ",
	"record": "2-5",
	"managerName": "Dom Scola"
  },


    {
	"teamName": "Make America Gronk Again",
	"description": "Technically, Dylan is not out of it yet. A narrow win squeaked out against Bob and he’s at least making some moves to stir his team’s loins. Maybe he thought a change of scenery for Lamar Jackson will wake him up a bit. Maybe he realized, like I did, that getting someone to offer fair trades for Pat Mahomes is harder than it seems. Maybe he didn’t plan his BYE weeks very well and was worried he would have to start Cam Akers at RB. Whatever the reason, Dylan is moving players around. Rob Gronkowski, notorious 5th round pick and lover of pussy, has caught a TD two weeks in a row. Nice.",
	"record": "2-5",
	"managerName": "Dylan Seeley"
  }

]
