[

    {
	"teamName": "Kneeling Kaepernicks",
	"description": " The winning streak is over, but this team is still stacked. You know if Hayden Hearse is carrying your team then they must have really died and gone to hell. Kyler Murray was looking like Nuk’s mom out there because he couldn’t see DeAndre Hopkins at all. Probably going to bounce back this week, I still think Quin’s team is the team to beat. ",
	"record": "4-2",
	"managerName": "Marquin Evans"
  },

    {
	"teamName": "Can U Digg it Sucka",
	"description": "Did the best WR group in our league just get better? Could Antonio Brown sign with Seattle? Imagine him and Russell Wilson uniting and attempting to connect with one another. Mr. Big Chest telling riveting tales of misadventures getting his weenie sucked at Wayside while at Central Michigan, and Danger Russ recalling the exact taste and texture of eating Future’s cum out of Ciara’s cursed pussy. Luke’s team could be in trouble at RB if he’s forced to start Perine this week but could be a force come playoffs.",
	"record": "4-2",
	"managerName": "Luke Morrell"
  },


    {
	"teamName": "Discount Double Check",
	"description": "Don’t look now, but Quis has won 3 in a row and is tied for the top of the standings with 4 wins, already better than his 3-10 season last year. Kenny G. was laying sweet Jazz music down all over the Jacksonville secondary and Matthew Berry will Lay a Pool of cum down if Chase Claypool scores another TD this week. Winning a game whilst starting Chris Thompson at RB? Respect. ",
	"record": "4-2",
	"managerName": "Marquis Evans"
  },



  {
	"teamName": "Tim Duncan",
	"description": "If you remove Julian Edelman’s clear outlier of a game in week 2 where he went off for 8 receptions and 179 yards, he has averaged 3 catches and 31 yards per game in the other 4 games he’s played. Schempp approaches his BYE week hell and might be forced to start Chase Edmonds - if Kenyan Drake is a bum and is starting over him, then Edmonds must be an extreme form of bum. Like homeless Vietnam-vet, paraplegic, threaten to suck your dick for walking by his shopping cart, kind of bum.",
	"record": "4-2",
	"managerName": "Alex Schempp"
  },


     {
	"teamName": "Kenyan Drake is a Bum",
	"description": "Vindication in the form of Steve losing when his opponent is at least somewhat competent - gotta love that shit. Kenyan Drake channelling his inner Oscar the Grouch with all the garbage time bullshit this week. Still, this team is actually pretty deep at RB, even without Nick Chubb. Seeing Giovani Bernard’s mustache has completely changed my opinion on him, fuck Joe Mixon give him the goddamn ball, he’ll get the entire opposing team’s front 7 pregnant. ",
	"record": "4-2",
	"managerName": "Steven Jackson"
  },

    {
	"teamName": "Show Me Your TD’s",
	"description": "Can we just gush about Derrick Henry for a minute? The man is built like the Predator and reached 21.62 MPH on his run last week. People aren’t meant to be that big and move that fast. It breaks my brain to see him hauling ass like that. Nick’s team is shaping up and looking dangerous from top to bottom, almost like his luck was too good this past week. He could be gunning straight for a big injury to one of his top players… Would be a real shame...",
	"record": "3-3",
	"managerName": "Nick Mauro"
  },

    {
	"teamName": "Baltimore Bombscares",
	"description": "Yikes. An all-time bad performance by the Baltimore Bombscares. Not sure if words can do it justice. Bob watching his team score 35.9 points and seeing his dog ripping shit up in the living room. Imagine a sad dejected man cleaning up scraps of shredded blankets and dog piss out of his router and wondering why he thought starting Rex Burkhead was a good idea. Depressing. ",
	"record": "4-2",
	"managerName": "Robert Sanders"
  },


    {
	"teamName": "Kittle and Bits",
	"description": "CeeDee Lamb outscoring Hopkins to win Jeff the week while the Red Rocket was throwing him the ball, who would have thought? Will Jonathan Taylor Thomas be a Home Improvement from Stefon Diggs at the flex? Who knows? Only glaring hole on this team seems to be at Tight End. Get it? Tight End… hole? It’s an asshole joke.",
	"record": "3-3",
	"managerName": "Jeff McNalley"
  },



    {
	"teamName": "Golladay Inn Express",
	"description": "Kamara on a BYE week and starting Jamaal Williams in his place? That’s just giving up and taking the L. Matt Ryan played well enough to keep him around a little longer like an abusive boyfriend. Sure he slapped you around and pushed you down a flight of stairs, but he scored 35.6 points this week. “He said he was sorry. He’s different now, we’re going to therapy next week” Whatever you need to tell yourself. Just don’t burn his dinner or you might end up with a black eye and your QB scoring 6.9 points on the week again. ",
	"record": "2-4",
	"managerName": "Sam Spradlin"
  },


    {
	"teamName": "Whole Lotta Redzone",
	"description": "Gotta feel for Andy, missing Saquan has just fucked his entire team up. At least he won his league entry fee and more playing daily fantasy. It’s sad to see David Johnson play like a broken old man. Take me back to 2016 where David Johnson had 2100 yards from scrimmage and it was the summer of beers. The good old days.",
	"record": "2-4",
	"managerName": "Andy Chandler"
  },

  	{
	"teamName": "Football Playin Kings in Space",
	"description": "Sweet Victory. There was a time last week where I thought I might not win a single game all season. Now is the start of a glorious win streak. Also fuck all of you for vetoing the Clyde for Jacobs trade. CEH rushing yards last week: 161. Josh Jacobs rushing yards last week: 0. Really makes you think. Am I gay for using the #1 waiver wire pick on a Defense to stream? Yes, but the waiver wire is as bare as my armpits were in 9th grade and I was really self-conscious about it. ",
	"record": "1-5",
	"managerName": "Dom Scola"
  },


    {
	"teamName": "Make America Gronk Again",
	"description": "A battle for the ages between the two bottom teams in our league and for 11th place in the power rankings. A blow-for-blow heavyweight match, can’t wait until Week 12 for the rematch. The Mahomes-Hill stack has been pretty lackluster so far, and with Sanders out for the near future Dylan’s RBs look pretty suspect right now. Remember picking Gronk in the 5th round? He finally scored! ",
	"record": "1-5",
	"managerName": "Dylan Seeley"
  }

]
